## 7.1 处理缺失值
### 7.1.1 过滤缺失值

In [1]:
#dropna返回所有非空数据集及其索引
import numpy as np
import pandas as pd
from numpy import nan as NA

In [4]:
#dropna返回所有非空数据集及其索引
data =pd.Series([1,NA,3.5,NA,7])
print(data.dropna())
#上面得例子和下面得代码等价
print(data[data.notnull()])

0    1.0
2    3.5
4    7.0
dtype: float64
0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
#dropna删除包含缺失值得行
#how="all"参数删除均为nan的行  data.dropna(how="all")
#想要删除列时，传入参数axis=1即可


#thresh参数表示保留一定数量的观察值的行
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA   #iloc表示到第几行，loc表示到整数
df.iloc[:2,2]=NA
print(df)
print(df.dropna(thresh=2))

          0         1         2
0 -1.636595       NaN       NaN
1 -1.123301       NaN       NaN
2 -0.554647       NaN  1.355724
3  0.470459       NaN -2.108274
4  1.631401  1.595943 -0.107675
5  0.677020 -1.406489 -1.265448
6  0.104145  1.093956  1.207495
          0         1         2
2 -0.554647       NaN  1.355724
3  0.470459       NaN -2.108274
4  1.631401  1.595943 -0.107675
5  0.677020 -1.406489 -1.265448
6  0.104145  1.093956  1.207495

### 7.1.2 补全缺失值

In [11]:
#主要用fillna方法补全，可以使用常数来代替
df.fillna(0)

          0         1         2
0 -1.636595  0.000000  0.000000
1 -1.123301  0.000000  0.000000
2 -0.554647  0.000000  1.355724
3  0.470459  0.000000 -2.108274
4  1.631401  1.595943 -0.107675
5  0.677020 -1.406489 -1.265448
6  0.104145  1.093956  1.207495

In [12]:
df.fillna({1:0.5,2:0}) #不同的列设置不同的值

          0         1         2
0 -1.636595  0.500000  0.000000
1 -1.123301  0.500000  0.000000
2 -0.554647  0.500000  1.355724
3  0.470459  0.500000 -2.108274
4  1.631401  1.595943 -0.107675
5  0.677020 -1.406489 -1.265448
6  0.104145  1.093956  1.207495

In [13]:
#填充Series平均值
data=pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 数据转换
### 7.2.1 删除重复值

In [14]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                  'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [15]:
#duplicated判断是否存在重复的行
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [17]:
data.drop_duplicates()#返回不重复的行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [18]:
data['v1']=range(7)
data.drop_duplicates(['k1'])  #指定列取唯一值

    k1  k2  v1
0  one   1   0
1  two   1   1

In [19]:
data.drop_duplicates(['k1','k2'],keep='last')#保持唯一性时，保存最后一个匹配到的值

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6